# Temperature Rating Get Temperature Rating Ids Method

Source: https://www.revitapidocs.com/2026/81609e04-b638-03eb-269a-42d3a7c47000.htm

---

| Temperature Rating Get Temperature Rating Ids Method |
| --- |

Gets all the Conductor Temperature Rating ids in the given document, sorted by name.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IList<ElementId> GetTemperatureRatingIds(
	Document document
)
```

```
Public Shared Function GetTemperatureRatingIds (
	document As Document
) As IList(Of ElementId)
```

```
public:
static IList<ElementId^>^ GetTemperatureRatingIds(
	Document^ document
)
```

```
static member GetTemperatureRatingIds :
        document : Document -> IList<ElementId>
```

#### Parameters

document Document
:   The document.

#### Return Value

IList ElementId
All the Conductor Temperature Rating ids in this document. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |

See Also

#### Reference

TemperatureRating Class Autodesk.Revit.DB.Electrical Namespace